## diff between numpy and pandas

## data

In [166]:
import pandas as pd
import numpy as np

In [167]:
np.random.seed(42)
dates = pd.date_range('2023-01-01', '2023-03-31')
products = ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard']
regions = ['North', 'South', 'East', 'West']

sales_data = pd.DataFrame({
    'Date': np.random.choice(dates, 500),
    'Product': np.random.choice(products, 500),
    'Region': np.random.choice(regions, 500),
    'Units_Sold': np.random.randint(1, 20, 500),
    'Unit_Price': np.random.uniform(100, 2000, 500).round(2),
    'Customer_ID': np.random.randint(1000, 1100, 500)
})
sales_data['Total_Sales'] = sales_data['Units_Sold'] * sales_data['Unit_Price']

In [168]:
df = sales_data

In [169]:
df.shape

(500, 7)

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         500 non-null    datetime64[ns]
 1   Product      500 non-null    object
 2   Region       500 non-null    object
 3   Units_Sold   500 non-null    int32
 4   Unit_Price   500 non-null    float64
 5   Customer_ID  500 non-null    int32
 6   Total_Sales  500 non-null    float64
dtypes: datetime64[ns](1), float64(2), int32(2), object(2)
memory usage: 23.6+ KB

In [171]:
df.select_dtypes('number').count()

Units_Sold     500
Unit_Price     500
Customer_ID    500
Total_Sales    500
dtype: int64

In [172]:
df.select_dtypes('object').count()

Product    500
Region     500
dtype: int64

## Question

### Select sales of 'Laptop' or 'Phone' with more than 10 units sold

- | for or
- & for and
- ~ for not

In [173]:
df[(df['Product']=="Laptop") | (df['Product']=="Phone") & (df['Units_Sold']>10)]

,Date,Product,Region,Units_Sold,Unit_Price,Customer_ID,Total_Sales
7,2023-03-16,Laptop,East,7,352.16,1033,2465.12
8,2023-03-16,Phone,North,17,372.73,1029,6336.41
10,2023-01-24,Phone,West,14,1492.51,1018,20895.14
11,2023-01-03,Phone,South,15,408.53,1030,6127.95
15,2023-03-29,Laptop,East,16,545.67,1048,8730.72
...,...,...,...,...,...,...,...
484,2023-02-19,Laptop,West,5,336.96,1034,1684.80
485,2023-02-04,Laptop,West,1,832.21,1010,832.21
486,2023-02-02,Laptop,East,3,1322.39,1063,3967.17
493,2023-03-06,Phone,South,14,155.24,1066,2173.36
496,2023-03-15,Laptop,West,18,836.58,1072,15058.44

### Sales from north region

In [174]:
df['Region'].unique()

array(['North', 'South', 'East', 'West'], dtype=object)

In [175]:
df[df['Region']=='North']

,Date,Product,Region,Units_Sold,Unit_Price,Customer_ID,Total_Sales
0,2023-02-21,Keyboard,North,12,1948.89,1002,23386.68
2,2023-03-13,Phone,North,9,583.03,1079,5247.27
3,2023-03-02,Keyboard,North,13,1091.29,1057,14186.77
4,2023-01-21,Tablet,North,15,751.04,1054,11265.60
5,2023-03-24,Phone,North,10,1111.27,1003,11112.70
...,...,...,...,...,...,...,...
489,2023-02-20,Tablet,North,5,361.86,1020,1809.30
490,2023-02-12,Tablet,North,1,1359.78,1068,1359.78
492,2023-03-08,Tablet,North,19,438.91,1019,8339.29
497,2023-02-12,Monitor,North,11,864.42,1060,9508.62
499,2023-01-29,Monitor,North,18,1069.21,1067,19245.78

### Select columns 'Product', 'Region', and 'Total_Sales' for all records

In [176]:
df[['Product','Region','Total_Sales']]

      Product Region  Total_Sales
0    Keyboard  North     23386.68
1     Monitor  South     18033.15
2       Phone  North      5247.27
3    Keyboard  North     14186.77
4      Tablet  North     11265.60
..        ...    ...          ...
495  Keyboard  South      4445.10
496    Laptop   West     15058.44
497   Monitor  North      9508.62
498    Tablet  South      3522.20
499   Monitor  North     19245.78

[500 rows x 3 columns]

## Question **Grouping Operations:**

### Group by operation

In [177]:
df.groupby('Region')['Product'].count()

Region
East     128
North    134
South    127
West     111
Name: Product, dtype: int64

### Find the total sales by product

In [178]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         500 non-null    datetime64[ns]
 1   Product      500 non-null    object
 2   Region       500 non-null    object
 3   Units_Sold   500 non-null    int32
 4   Unit_Price   500 non-null    float64
 5   Customer_ID  500 non-null    int32
 6   Total_Sales  500 non-null    float64
dtypes: datetime64[ns](1), float64(2), int32(2), object(2)
memory usage: 23.6+ KB

In [179]:
df.groupby('Product')['Total_Sales'].sum()

Product
Keyboard    1074551.96
Laptop      1199835.35
Monitor      950987.34
Phone        959547.49
Tablet       988081.01
Name: Total_Sales, dtype: float64

In [180]:
df.groupby('Product')['Total_Sales'].count()

Product
Keyboard    110
Laptop      107
Monitor      90
Phone        97
Tablet       96
Name: Total_Sales, dtype: int64

In [181]:
df['Product'].unique()

array(['Keyboard', 'Monitor', 'Phone', 'Tablet', 'Laptop'], dtype=object)

### Calculate the average units sold by region

### Find the top 3 customers by total spending

In [182]:
df.groupby('Customer_ID')['Total_Sales'].sum().sort_values()

Customer_ID
1066      4486.09
1012      6021.82
1053      8879.71
1017      9147.48
1064     11376.84
          ...
1034    105255.55
1085    106438.14
1063    121376.18
1013    124894.36
1047    127658.62
Name: Total_Sales, Length: 98, dtype: float64

In [183]:
df.groupby('Customer_ID')['Total_Sales'].sum().sort_values(ascending = False).head(3)

Customer_ID
1047    127658.62
1013    124894.36
1063    121376.18
Name: Total_Sales, dtype: float64

## Is Nan

In [184]:
df.isna()

      Date  Product  Region  Units_Sold  Unit_Price  Customer_ID  Total_Sales
0    False    False   False       False       False        False        False
1    False    False   False       False       False        False        False
2    False    False   False       False       False        False        False
3    False    False   False       False       False        False        False
4    False    False   False       False       False        False        False
..     ...      ...     ...         ...         ...          ...          ...
495  False    False   False       False       False        False        False
496  False    False   False       False       False        False        False
497  False    False   False       False       False        False        False
498  False    False   False       False       False        False        False
499  False    False   False       False       False        False        False

[500 rows x 7 columns]

This are consider None 
- np.nan
- Nan
- None
- cell is balnk or empty

In [185]:
print(pd.isna(np.nan))
print(pd.isna(np.NaN))
print(pd.isna(pd.NA))

True
True
True

- '?'
- #######
- -----

In [186]:
df.isna().sum()

Date           0
Product        0
Region         0
Units_Sold     0
Unit_Price     0
Customer_ID    0
Total_Sales    0
dtype: int64

## loc and iloc

In [187]:
df.iloc[0] # 1st row

Date           2023-02-21 00:00:00
Product                   Keyboard
Region                       North
Units_Sold                      12
Unit_Price                 1948.89
Customer_ID                   1002
Total_Sales               23386.68
Name: 0, dtype: object

In [188]:
# 2nd row and 3rd column
df.iloc[2,3]

9

In [189]:
df.head()

,Date,Product,Region,Units_Sold,Unit_Price,Customer_ID,Total_Sales
0,2023-02-21,Keyboard,North,12,1948.89,1002,23386.68
1,2023-01-15,Monitor,South,15,1202.21,1087,18033.15
2,2023-03-13,Phone,North,9,583.03,1079,5247.27
3,2023-03-02,Keyboard,North,13,1091.29,1057,14186.77
4,2023-01-21,Tablet,North,15,751.04,1054,11265.60

In [190]:
df.iloc[2,3:]

Units_Sold           9
Unit_Price      583.03
Customer_ID       1079
Total_Sales    5247.27
Name: 2, dtype: object

In [191]:
df.columns

Index(['Date', 'Product', 'Region', 'Units_Sold', 'Unit_Price', 'Customer_ID',
       'Total_Sales'],
      dtype='object')

## dataframe

In [192]:
C = pd.DataFrame({
    'A':[12,13,14,15],
    'B' : ['x','y','z','w'],
    'C':[12 , 0 , 12 , 3]
        })
C

    A  B   C
0  12  x  12
1  13  y   0
2  14  z  12
3  15  w   3

In [193]:
C = pd.DataFrame({
    'A':[12,13,14,15],
    'B' : ['x','y','z','w'],
    'C':[12 , 0 , 12 , 3]
        },index = ['a','b','c','d'])
C

    A  B   C
a  12  x  12
b  13  y   0
c  14  z  12
d  15  w   3

In [194]:
C.shape

(4, 3)

In [195]:
C.columns

Index(['A', 'B', 'C'], dtype='object')